In [2]:
import pandas as pd
df = pd.DataFrame({"col1":[1,2,3,4],"col2":[444,555,666,444],"col3":["abc","def","ghi","xyz"]})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [3]:
df["col2"].unique()

array([444, 555, 666], dtype=int64)

In [8]:
df["col2"].nunique()

3

In [11]:
df["col2"].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [13]:
df[df["col1"]>2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [15]:
df[(df["col1"] > 2) & (df["col2"] == 444)]

   col1  col2 col3
3     4   444  xyz

In [23]:
df.apply(lambda x : x*2)

   col1  col2    col3
0     2   888  abcabc
1     4  1110  defdef
2     6  1332  ghighi
3     8   888  xyzxyz

In [26]:
df.sort_values(by="col2", inplace = True)

In [27]:
df

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [28]:
df.isnull()

    col1   col2   col3
0  False  False  False
3  False  False  False
1  False  False  False
2  False  False  False

In [31]:
import numpy as np 
df.dropna()

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [48]:
df2 = pd.DataFrame({"col1":[1,2,3,np.nan],"col2":[np.nan,444,555,666],"col3":["abc","def","ghi","xyz"]})

In [49]:
df2["col1"].fillna(value = df2["col1"].mean())

0    1.0
1    2.0
2    3.0
3    2.0
Name: col1, dtype: float64

In [50]:
df3 = pd.DataFrame({"A":["foo","foo","foo","bar","bar","bar"],
"B":["one","one","two","two","one","one"],
"C":["x","y","x","y","x","y"],
"D":[1,3,2,5,4,1]})

In [51]:
df3

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [53]:
df3.pivot_table(values=["D"],index=["A","B"],columns=["C"])

           D
C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [4]:
pd.read_excel("Exemplo_Excel.xlsx",sheet_name="Sheet1")

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15